Tekla Open API Reference for Tekla Structures 2025
IMovableRelative Interface
 The IMovableRelative interface is implemented by objects that can be moved.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IMovableRelative
Public Interface IMovableRelative
The IMovableRelative type exposes the following members.
Methods
Name | Description
MoveObjectRelative
 Moves the current object using the move vector. The move vector can be calculated as in the following example.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace